POS_SYSTEM/app/Models/ProductModel.php

    public function getProductsWithCategory($limit = 50)
    {
        return $this->select('
            product.product_id,
            product.product_name,
            product.barcode,
            product.price,
            product.stock_quantity,
            product.category_id,
            category.category_name
        ')
        ->join('category', 'category.category_id = product.category_id')
        ->orderBy('product.product_name', 'ASC')
        ->limit((int)$limit)
        ->findAll();
---
SELECT `product`.`product_id`, `product`.`product_name`, `product`.`barcode`, `product`.`price`, `product`.`stock_quantity`, `product`.`category_id`, `category`.`category_name`
FROM `product`
JOIN `category` ON `category`.`category_id` = `product`.`category_id`
ORDER BY `product`.`product_name` ASC
 LIMIT 50