POS_SYSTEM/app/Models/SaleitemModel.php

    public function getItemsBySale($sale_id)
    {
        return $this->where('sale_id', $sale_id)->findAll();
---
SELECT *
FROM `sale_item`
WHERE `sale_id` = 195