New folder/POS_SYSTEM/app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'jackbanda'
 LIMIT 1
---
    public function userlogin(){

        $username=trim($this->request->getPost('username'));
        $username=preg_replace('/\s+/','',$username);
        $password=$this->request->getPost('password');

        $rules=[
            'username'=>'required',
            'password'=>'required',

        ];

        if(!$this->validate($rules)){
        return view('auth/login',[
            'validate'=>$this->validator]);
        }

        if($username){
        $model=new UserModel();

        $user = $model->where('username', $username)->first();