app/Controllers/NewSalesController.php

    public function updateQuantity(){
$this->trace('updateQuantity', 'ENTER | adjust item quantity');

    if(!session()->get('logged_in')){
        return redirect()->to('/userlogin')->with('error','invalid session or session expired ');
    }
    if ($this->hasPendingSale()) {
        return redirect()->to('/newsales')->with('error', 'Complete or cancel the pending payment before changing the cart.');
    }

    $product_id = $this->request->getPost('product_id');
    $delta      = $this->request->getPost('delta');

    $delta = (int)$delta;

    if(!$product_id){
        return redirect()->back()->with('error','product not specified');
    }

    $cart = session()->get('cart') ?? [];

    $product_model = new ProductModel();
    $product = $product_model->find($product_id);
---
SELECT *
FROM `product`
WHERE `product`.`product_id` = '43'