app/Models/PaymentModel.php

SELECT `payment_method`, `payment_status`
FROM `payment`
WHERE `sale_id` = 195
 LIMIT 1
---
    public function getPaymentBySale($sale_id)
    {
        return $this->select('payment_method, payment_status')
                    ->where('sale_id', $sale_id)
                    ->first();