app/Models/ReceiptModel.php

SELECT *
FROM `receipt`
WHERE `sale_id` = 195
 LIMIT 1
---
    public function getBySale($sale_id)
    {
        return $this->where('sale_id', $sale_id)->first();