app/Models/SaleModel.php

public function getSales($limit = NULL){



$this->select("
    sale.sale_id,
    sale.sale_date,
    sale.total_amount,
    sale.status,
    user.username AS username,
    SUM(sale_item.quantity) AS items_count
")
->join('user', 'user.username = sale.handled_by_user', 'left')
->join('sale_item', 'sale_item.sale_id = sale.sale_id', 'left')
->groupBy('sale.sale_id')
->orderBy('sale.sale_date', 'DESC');

            if(
                empty($limit)
            ){
                $limit=3;
                $this->limit($limit);

            }
            log_message('debug', 'First sale row: ' . json_encode($results[0] ?? []));
            return $this->findAll();
---
SELECT `sale`.`sale_id`, `sale`.`sale_date`, `sale`.`total_amount`, `sale`.`status`, `user`.`username` AS `username`, SUM(sale_item.quantity) AS items_count
FROM `sale`
LEFT JOIN `user` ON `user`.`username` = `sale`.`handled_by_user`
LEFT JOIN `sale_item` ON `sale_item`.`sale_id` = `sale`.`sale_id`
GROUP BY `sale`.`sale_id`
ORDER BY `sale`.`sale_date` DESC