POS_SYSTEM/app/Controllers/AuthController.php

    public function userlogin(){

        $username=$this->request->getPost('username');
        $password=$this->request->getPost('password');

        $rules=[
            'username'=>'required',
            'password'=>'required',

        ];

        if(!$this->validate($rules)){
        return view('auth/login',[
            'validate'=>$this->validator]);
        }

        if($username){
        $model=new UserModel();

        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'lweendo_klen'
 LIMIT 1