POS_SYSTEM/app/Controllers/DashBoard.php

SELECT `sale`.`sale_id`, `sale`.`sale_date`, `sale`.`total_amount`, `sale`.`status`, `customer`.`firstname`, `user`.`username`, COUNT(sale_item.sale_item_id) AS items_count
FROM `sale`
LEFT JOIN `customer` ON `customer`.`customer_id` = `sale`.`customer_id`
LEFT JOIN `user` ON `user`.`user_id` = `sale`.`user_id`
LEFT JOIN `sale_item` ON `sale_item`.`sale_id` = `sale`.`sale_id`
GROUP BY `sale`.`sale_id`
ORDER BY `sale`.`sale_date` DESC
 LIMIT 10
---
    public function index()
    {
        if (! session()->get('logged_in')) {
            return redirect()->to('userlogin')
                             ->with('message', 'Session expired or invalid.');
        }

        $user = [
            'name' => session()->get('username'),
            'role' => session()->get('role')
        ];

        $saleModel = new SaleModel();

        $recent_sales = $saleModel
            ->select("
                sale.sale_id,
                sale.sale_date,
                sale.total_amount,
                sale.status,
                customer.firstname,
                user.username,
                COUNT(sale_item.sale_item_id) AS items_count
            ")
            ->join('customer', 'customer.customer_id = sale.customer_id', 'left')
            ->join('user', 'user.user_id = sale.user_id', 'left')
            ->join('sale_item', 'sale_item.sale_id = sale.sale_id', 'left')
            ->groupBy('sale.sale_id')
            ->orderBy('sale.sale_date', 'DESC')
            ->limit(10)
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `product`
SELECT `product`.`product_name`, `product`.`stock_quantity`, `category`.`category_name` AS `category`
FROM `product`
LEFT JOIN `category` ON `category`.`category_id` = `product`.`category_id`
WHERE `stock_quantity` < 10
ORDER BY `stock_quantity` ASC
---
            ->countAllResults();

        $productModel = new ProductModel();
        $productsCount = $productModel->countAllResults();

        $lowStock = $productModel
            ->select("
                product.product_name,
                product.stock_quantity,
                category.category_name AS category
            ")
            ->join('category', 'category.category_id = product.category_id', 'left')
            ->where('stock_quantity <', 10)
            ->orderBy('stock_quantity', 'ASC')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `category`
SELECT COUNT(*) AS `numrows`
FROM `customer`
---
        $lowStockCount = count($lowStock);

        $categoryModel = new CategoryModel();
        $categoriesCount = $categoryModel->countAllResults();

        $customerModel = new CustomerModel();
        $customersCount = $customerModel->countAllResults();

SELECT `category_name`
FROM `category`
SELECT `product`.`product_id`, `product`.`product_name`, `product`.`price`, `category`.`category_name` AS `category`
FROM `product`
LEFT JOIN `category` ON `product`.`category_id` = `category`.`category_id`
---
    public function newsaledashboard(){
        $productModel  = new ProductModel();
        $categoryModel = new CategoryModel();
        $category      = $categoryModel->select('category_name')->findAll();

        $searchTerm = $this->request->getGet('search');

        if ($searchTerm) {
            $products = $productModel
                ->select('
                    product.product_id,
                    product.product_name,
                    product.price,
                    category.category_name AS category
                ')
                ->join('category', 'product.category_id = category.category_id', 'left')
                ->like('product.product_name', $searchTerm)
                ->findAll();
        } else {
            $products = $productModel
                ->select('
                    product.product_id,
                    product.product_name,
                    product.price,
                    category.category_name AS category
                ')
                ->join('category', 'product.category_id = category.category_id', 'left')
                ->findAll();