POS_SYSTEM/app/Controllers/DashBoard.php

        $productModel = new ProductModel();

        // Total Products
        $productsCount = $productModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `product`


        $categoryModel = new CategoryModel();

        $categoriesCount = $categoryModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `category`


        $customerModel = new CustomerModel();

        $customersCount = $customerModel->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `customer`