POS_SYSTEM/app/Controllers/DashBoard.php

SELECT COUNT(*) AS `numrows`
FROM `sale`
WHERE `sale_date` = '2026-07-21'
---
    public function index()
    {
        if (! session()->get('logged_in')) {
            return redirect()->to('userlogin')
                             ->with('message', 'Session expired or invalid.');
        }

        $user = [
            'name' => session()->get('username'),
            'role' => session()->get('role')
        ];

        $saleModel = new SaleModel();

        $recent_sales= $saleModel->getSales(10);

        $todaySalesCount = $saleModel
            ->where('sale_date', date('Y-m-d'))
            ->countAllResults();

        $todayRevenue = $saleModel
            ->selectSum('total_amount')
            ->where('sale_date', date('Y-m-d'))
            ->first();