POS_SYSTEM/app/Controllers/newsales.php

SELECT `product`.`product_id`, `product`.`product_name`, `product`.`price`, `product`.`stock_quantity`, `category`.`category_name`
FROM `product`
JOIN `category` ON `category`.`category_id` = `product`.`category_id`
ORDER BY `product`.`product_name` ASC
 LIMIT 50
SELECT `customer_id`, `firstname`
FROM `customer`
ORDER BY `firstname` ASC
---
    public function Newsale()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('userlogin')
                             ->with('message', 'Session expired or invalid.');
        }

        $user = [
            'name' => session()->get('username'),
        ];

        // Load the products
        $product_model = new ProductModel();
        $products = $product_model
            ->select('product.product_id, product.product_name, product.price, product.stock_quantity, category.category_name')
            ->join('category', 'category.category_id = product.category_id')
            ->orderBy('product.product_name', 'ASC')
            ->limit(50)
            ->findAll();

        // Load the customers for the dropdown
        $customer_model = new CustomerModel();
        $get_customers = $customer_model
            ->select('customer_id, firstname')
            ->orderBy('firstname', 'ASC')
            ->findAll();